# Trabalho Prático 1

In [1]:
# pacotes
import io
import sqlite3
import pandas as pd

In [2]:
# Conexão e leitura BD
conn = sqlite3.connect('SQLite_Python.db')
cursor = conn.cursor()

f = io.open('database.sql', 'r', encoding='utf-8')
sql = f.read()
cursor.executescript(sql)

IntegrityError: UNIQUE constraint failed: Especies.nome

In [4]:
# Verificando conexão e db

query = """
SELECT * 
FROM Especies
"""

df = pd.read_sql_query(query, conn)
df

,nome,classificacao,altura_media,cabelo,tempo_de_vida_medio,idioma,planeta
0,Hutt,gastropode,300,nao,1000,Huttese,Nal Hutta
1,Especie do Yoda,mamifero,66,sim,900,Basico Galatico,Dagobah
2,Trandoshano,reptiliano,200,nao,60,Dosh,Trandosha
3,Mon Calamari,anfibio,160,nao,80,Mon Calamarian,Mon Cala
4,Ewok,mamifero,100,sim,65,Ewokese,Endor
5,Sullustano,mamifero,180,nao,75,Sullutese,Sullust
6,Neimoidiano,reptiliano,180,nao,98,Neimoidia,Cato Neimoidia
7,Gungan,anfibio,190,nao,65,Gungan,Naboo
8,Toydariano,mamifero,120,nao,91,Toydarian,Toydaria
9,Dug,mamifero,100,nao,75,Dugese,Malastare
10,Twi'lek,mamifero,200,nao,75,Twi'leki,Ryloth
11,Toong,anfibio,200,nao,93,Tundan,Tund
12,Cereano,mamifero,200,sim,60,Cerean,Cerea
13,Nautolano,anfibio,180,nao,70,Nautila,Glee Anselm
14,Zabrak,mamifero,180,sim,180,Zabraki,Iridonia
15,Tholothiano,mamifero,175,sim,80,Tholothian,Tholoth
16,Iktotchi,mamifero,180,nao,90,Iktotchese,Iktotch
17,Quermiano,mamifero,240,nao,86,Quermian,Quermia
18,Kel Dor,reptiliano,180,nao,70,Kel Dor,Dorin
19,Chagriano,anfibio,190,nao,75,Chagria,Champala
20,Geonosiano,insetoide,178,nao,60,Geonosian,Geonosis
21,Mirialano,mamifero,180,sim,68,Mirialan,Mirial
22,Besalisk,anfibio,178,nao,75,Besalisk,Ojom
23,Kaminoano,anfibio,220,nao,80,Kaminoan,Kamino
24,Skakoano,mamifero,175,nao,100,Skakoan,Skako
25,Muun,mamifero,190,nao,100,Muun,Muunilinst
26,Togruta,mamifero,180,nao,94,Togruti,Shili
27,Kaleesh,reptiliano,170,nao,80,Kaleesh,Kalee
28,Pau'an,mamifero,190,nao,700,Utapese,Utapau
29,Wookiee,mamifero,210,sim,400,Shyriiwook,Kashyyyk
30,Droide,artificial,indefinida,nao,indefinido,Basico Galatico,Coruscant
31,Humano,mamifero,180,sim,120,Basico Galatico,Coruscant
32,Rodiano,reptiliano,170,nao,55,Basico Galatico,Rodia
33,Umbarano,mamifero,180,sim,80,Umbarese,Umbara
34,Vulptereeno,reptiliano,100,nao,45,Vulpterish,Vulpter

### Consultas de álgebra relacional

#### A0.πnome σplaneta =’Tatooine’ (Personagens)

In [5]:
query = """
SELECT nome
FROM Personagens
WHERE planeta ="Tatooine"
"""

df = pd.read_sql_query(query, conn)
df

                 nome
0      Luke Skywalker
1               C-3PO
2         Darth Vader
3           Owen Lars
4  Beru Whitesun lars
5               R5-D4
6   Biggs Darklighter
7    Anakin Skywalker
8      Shmi Skywalker
9         Cliegg Lars

#### A1.πnome_nave σcusto em creditos<500000 ∧ planeta=’Naboo’ (Naves ⋊⋉ Fabricantes)

In [56]:
query = """
SELECT N.nome
FROM Naves N JOIN Fabricantes F ON N.fabricante=F.nome
WHERE N.custo_em_creditos < 500000 AND F.planeta ="Naboo"  
"""

df = pd.read_sql_query(query, conn)
df

              nome
0    Naboo fighter
1  Rebel transport

#### A2.πnome especie σclassificacao=’reptiliano’ ∧ (clima = ’Arido’ ∨ clima = ’Umido’) (Especies ⋊⋉ Planetas)

In [57]:
query = """
SELECT E.nome
FROM Especies E JOIN Planetas P ON E.planeta = P.nome
WHERE (E.classificacao = "reptiliano") AND (P.clima = "arido" OR P.clima = "umido")
"""

df = pd.read_sql_query(query, conn)
df

          nome
0  Trandoshano
1  Neimoidiano

#### A3.πnome planeta σproduto = ’ambos’ (Planetas ⋊⋉ Fabricantes)

In [14]:
query = """
SELECT P.nome
FROM Planetas P JOIN Fabricantes F ON P.nome = F.planeta
WHERE produto = "ambos"
"""

df = pd.read_sql_query(query, conn)
df

       nome
0  Geonosis
1    Fresia
2      Kuat
3   Rothana
4    Lianna

#### A9.πnome,sois,luas σsois>luas ∧ luas>0 (Planetas)

In [8]:
query = """
SELECT nome, sois, luas
FROM Planetas
WHERE sois > luas AND luas > 0
"""

df = pd.read_sql_query(query, conn)
df

       nome  sois  luas
0  Mon Cala     2     1
1  Toydaria     2     1
2     Cerea     3     1
3       Dac     2     1

### Consultas de linguagem natural

#### B0. Liste (1) o nome dos personagens, (2) seu planeta de origem e (3) o planeta de sua esp ́ecie para os personagens n ̃ao humanos que nasceram em um planeta diferente do planeta de origem de sua esp ́ecie.

In [42]:
query = """
SELECT P.nome, P.planeta as planeta_origem_personagem, E.planeta as planeta_origem_especie
FROM Personagens P JOIN Especies E ON P.especie = E.nome
WHERE P.especie IS NOT "Humano" AND E.planeta IS NOT P.planeta
"""

df = pd.read_sql_query(query, conn)
df

         nome planeta_origem_personagem planeta_origem_especie
0       C-3PO                  Tatooine              Coruscant
1       R2-D2                     Naboo              Coruscant
2       R5-D4                  Tatooine              Coruscant
3       IG-88                   Halowan              Coruscant
4  Darth Maul                  Dathomir               Iridonia
5  Adi Gallia                 Coruscant                Tholoth
6      R4-P17                     Nubia              Coruscant

#### B2. Liste (1) o nome do fabricante, (2) a quantidade de naves e (3) a quantidade de veÍculos produzidos por cada fabricante que produza ambos os tipos de produtos

In [43]:
query = """
SELECT f.nome, COUNT(DISTINCT n.nome) AS quantidade_naves, COUNT(DISTINCT v.nome) AS quantidade_veiculos
FROM Fabricantes f
JOIN Naves n ON f.nome = n.fabricante
JOIN veiculos v ON f.nome = v.fabricante
GROUP BY f.nome
HAVING COUNT(DISTINCT n.nome) > 0 AND COUNT(DISTINCT v.nome) > 0;
"""

df = pd.read_sql_query(query, conn)
df

,nome,quantidade_naves,quantidade_veiculos
0,Huppla Pasa Tisc Shipwrights Collective,1,2
1,Incom Corporation,3,2
2,Kuat Drive Yards,4,4
3,Rothana Heavy Engineering,1,4
4,Sienar Fleet Systems,4,3

#### B3. Liste (1) o nome do personagem e (2) a altura dos personagens mais altos de cada esp ́ecie, ordenados em ordem crescente por altura.

In [49]:
query = """
SELECT p.nome, p.altura
FROM Personagens p
JOIN (
  SELECT especie, MAX(altura) AS altura_maxima
  FROM Personagens
  GROUP BY especie
) AS subquery ON p.especie = subquery.especie AND p.altura = subquery.altura_maxima
ORDER BY p.altura ASC;

"""

df = pd.read_sql_query(query, conn)
df

                     nome  altura
0                    Yoda      66
1   Wicket Systri Warrick      88
2                Dud Bolt      94
3                 Sebulba     112
4                   Watto     137
5               Nien Nunb     160
6          Ben Quadinaros     163
7         Luminara Unduli     170
8                  Greedo     173
9   Jabba Desilijic Tiure     175
10             Darth Maul     175
11               Shaak Ti     178
12              Sly Moore     178
13                 Ackbar     180
14            Bib Fortuna     180
15      Poggle the Lesser     183
16             Adi Gallia     184
17            Saesee Tiin     188
18               Plo Koon     188
19                  Bossk     190
20               San Hill     191
21            Nute Gunray     191
22             Wat Tambor     193
23             Mas Amedda     196
24              Kit Fisto     196
25        Dexter Jettster     198
26           Ki-Adi-Mundi     198
27                  IG-88     200
28            Darth Vader     202
29             Tion Medon     206
30               Grievous     216
31           Roos Tarpals     224
32                Lama Su     229
33                Tarfful     234
34            Yarael Poof     264

#### B4. Liste (1) o nome do planeta e (2) a quantidade de personagens que nasceram nele para o planeta com o maior n ́umero de personagens.

In [50]:
query = """
SELECT P.nome, COUNT(C.nome) AS quantidade_personagens
FROM Planetas P
JOIN Personagens C ON P.nome = C.planeta
GROUP BY P.nome
ORDER BY quantidade_personagens DESC
LIMIT 1;
"""

df = pd.read_sql_query(query, conn)
df

    nome  quantidade_personagens
0  Naboo                      11

#### B7. Liste (1) o nome dos fabricantes que produzem mais naves do que ve ́ıculos e (2) a quantidade de naves e (3) a quantidade de ve ́ıculos produzidos por cada um.

In [53]:
query = """
SELECT f.nome, COUNT(DISTINCT n.nome) AS quantidade_naves, COUNT(DISTINCT v.nome) AS quantidade_veiculos
FROM Fabricantes f
JOIN Naves n ON f.nome = n.fabricante
JOIN Veiculos v ON f.nome = v.fabricante
GROUP BY f.nome
HAVING COUNT(DISTINCT n.nome) > COUNT(DISTINCT v.nome);
"""

df = pd.read_sql_query(query, conn)
df

                   nome  quantidade_naves  quantidade_veiculos
0     Incom Corporation                 3                    2
1  Sienar Fleet Systems                 4                    3

#### B5. Liste (1) o nome, (2) o tempo de vida m ́edio e (3) o planeta das esp ́ecies que ou tenham tempo m ́edio de vida maior ou igual a 90 anos e que sejam de um planeta com gravidade superior a 1, ou que sejam de um planeta onde s ̃ao produzidas naves com custo em cr ́editos maior ou igual a 1000000.

In [58]:
query = """
SELECT e.nome as nome_especie, e.tempo_de_vida_medio, p.nome as nome_planeta
FROM Especies e
JOIN planetas p ON e.planeta = p.nome
WHERE (e.tempo_de_vida_medio >= 90 AND p.gravidade > 1)
   OR (p.nome IN (
        SELECT f.planeta
        FROM Fabricantes f
        JOIN Naves n ON f.nome = n.fabricante
        WHERE n.custo_em_creditos >= 1000000
      ));
"""

df = pd.read_sql_query(query, conn)
df

  nome_especie  tempo_de_vida_medio nome_planeta
0         Hutt                 1000    Nal Hutta
1       Gungan                   65        Naboo
2        Toong                   93         Tund